In [19]:
import pandas as pd
from sklearn.preprocessing import StandardScaler, MinMaxScaler, LabelEncoder

In [20]:
# Load the Titanic dataset from URL
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
# 1. Fill missing Age with median
df['Age'].fillna(df['Age'].median(), inplace=True)

# 2. Fill missing Embarked with mode
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

# 3. Drop Cabin column
df.drop(columns=['Cabin'], inplace=True)

# 4. Cap Fare at the 99th percentile to reduce outliers
q99 = df['Fare'].quantile(0.99)
df['Fare'] = df['Fare'].clip(upper=q99)

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [22]:
# One-hot encode Sex and Embarked (nominal data)
df_ohe = pd.get_dummies(df[['Sex', 'Embarked']], drop_first=True)

# Show new encoded columns
df_ohe.head()

   Sex_male  Embarked_Q  Embarked_S
0      True       False        True
1     False       False       False
2     False       False        True
3     False       False        True
4      True       False        True

In [23]:
# Label Encoding for Pclass (ordinal)
le = LabelEncoder()

df['Pclass'] = le.fit_transform(df['Pclass'])

df['Pclass'].head()

0    2
1    0
2    2
3    0
4    2
Name: Pclass, dtype: int64

In [24]:
df['Pclass'].value_counts()

Pclass
2    491
0    216
1    184
Name: count, dtype: int64

In [25]:
# Select numeric columns
numeric_cols = df[['Age', 'Fare']]

# StandardScaler
scaler = StandardScaler()
scaled = scaler.fit_transform(numeric_cols)

# Convert back to DataFrame
df_scaled = pd.DataFrame(scaled, columns=['Age_scaled', 'Fare_scaled'])
df_scaled.describe()

         Age_scaled   Fare_scaled
count  8.910000e+02  8.910000e+02
mean   2.272780e-16 -5.582266e-17
std    1.000562e+00  1.000562e+00
min   -2.224156e+00 -7.346960e-01
25%   -5.657365e-01 -5.485701e-01
50%   -1.046374e-01 -3.945992e-01
75%    4.333115e-01 -5.288611e-03
max    3.891554e+00  5.124239e+00

In [26]:
# MinMaxScaler
mm = MinMaxScaler()
normalized = mm.fit_transform(numeric_cols)

df_norm = pd.DataFrame(normalized, columns=['Age_norm', 'Fare_norm'])
df_norm.describe()

         Age_norm   Fare_norm
count  891.000000  891.000000
mean     0.363679    0.125398
std      0.163605    0.170775
min      0.000000    0.000000
25%      0.271174    0.031768
50%      0.346569    0.058048
75%      0.434531    0.124495
max      1.000000    1.000000

### Exercise 3 â€” Transformation Strategist

1. neighborhood  
Use One-Hot Encoding because neighborhoods (Kentron, Arabkir, Davtashen) are nominal categories with no natural order.

2. num_rooms  
Keep as numeric. Optional: StandardScaler or MinMaxScaler, because it is a numerical feature.

3. building_condition  
Use Ordinal Encoding because the categories have a natural order: Poor < Average < Good < Excellent.

4. price_amd  
Apply scaling (StandardScaler or MinMaxScaler) because price is numerical and has a wide range. Encoding is not needed.